app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT "ideas".* FROM "ideas"

  def show
    @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at", "author") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test5"], ["description", "ha"], ["picture", "curve.JPG"], ["created_at", "2018-08-18 05:55:46.381899"], ["updated_at", "2018-08-18 05:55:46.381899"], ["author", "memememe"]]

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "description" = ?, "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["description", "ruby ruby"], ["picture", "wallhaven-23575.jpg"], ["updated_at", "2018-08-18 05:34:47.550626"], ["id", 3]]

  def destroy
    @idea.destroy
---
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 4]]

    def set_idea
      @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]